#+TITLE: Embeddings & Vector Stores - Reading Notes
#+AUTHOR: Google Whitepaper (February 2025)
#+DATE: March 31, 2025
#+PROPERTY: header-args:python :session *python* :results output

* Endnotes

#+begin_src sh
#!/usr/bin/env bash
# Ensure the papers directory exists
PAPERS_DIR="../../papers"
mkdir -p "$PAPERS_DIR"

# Function to download a paper
download_paper() {
    local url="$1"
    local filename="$2"
    
    # Check if file already exists
    if [ -f "$PAPERS_DIR/$filename" ]; then
        echo "SKIP: $filename (already exists)"
        return
    fi
    
    # Download the paper
    echo "DOWNLOAD: $filename"
    wget -q -O "$PAPERS_DIR/$filename" "$url"
    
    # Check download success
    if [ $? -eq 0 ]; then
        echo "SUCCESS: $filename"
    else
        echo "FAILED: $filename"
    fi
}

# Print start message
echo "Starting paper download for embeddings and vector stores..."

# List of papers to download from the endnotes
download_paper "https://arxiv.org/pdf/1602.02215.pdf" "shazeer-2016-swivel.pdf"
download_paper "https://arxiv.org/pdf/1301.3781.pdf" "mikolov-2013-word2vec.pdf"
download_paper "https://arxiv.org/pdf/1607.04606.pdf" "bojanowski-2016-fasttext.pdf"
download_paper "https://arxiv.org/pdf/2210.07316.pdf" "muennighoff-2022-mteb.pdf"
download_paper "https://arxiv.org/pdf/1405.4053.pdf" "le-2014-doc2vec.pdf"
download_paper "https://arxiv.org/pdf/2104.08821.pdf" "gao-2021-simcse.pdf"
download_paper "https://arxiv.org/pdf/2201.01279.pdf" "wang-2022-text-embeddings.pdf"
download_paper "https://arxiv.org/pdf/2304.01982.pdf" "lee-2023-token-retrieval.pdf"
download_paper "https://arxiv.org/pdf/1709.07604.pdf" "cai-2017-graph-embedding.pdf"
download_paper "https://arxiv.org/pdf/2204.07120.pdf" "dong-2022-dual-encoder.pdf"
download_paper "https://arxiv.org/pdf/1603.09320.pdf" "malkov-2016-hnsw.pdf"
download_paper "https://arxiv.org/pdf/1908.10396.pdf" "guo-2020-anisotropic.pdf"
download_paper "https://arxiv.org/pdf/2401.08281.pdf" "douze-2024-faiss.pdf"
download_paper "https://arxiv.org/pdf/2403.20327.pdf" "lee-2024-gecko.pdf"
download_paper "https://arxiv.org/pdf/2302.13971.pdf" "touvron-2023-llama.pdf"
download_paper "https://arxiv.org/pdf/2502.06786.pdf" "nair-2025-matryoshka.pdf"
download_paper "https://arxiv.org/pdf/2407.01449.pdf" "faysse-2024-colpali.pdf"

# Additional important papers from Google
download_paper "https://storage.googleapis.com/deepmind-media/gemini/gemini_1_report.pdf" "gemini-team-2023.pdf"

# Print completion message
echo "Embedding papers download script completed."
#+end_src

#+RESULTS:
| Starting  | paper                         | download | for    | embeddings | and | vector | stores... |
| DOWNLOAD: | shazeer-2016-swivel.pdf       |          |        |            |     |        |           |
| SUCCESS:  | shazeer-2016-swivel.pdf       |          |        |            |     |        |           |
| DOWNLOAD: | mikolov-2013-word2vec.pdf     |          |        |            |     |        |           |
| SUCCESS:  | mikolov-2013-word2vec.pdf     |          |        |            |     |        |           |
| DOWNLOAD: | bojanowski-2016-fasttext.pdf  |          |        |            |     |        |           |
| SUCCESS:  | bojanowski-2016-fasttext.pdf  |          |        |            |     |        |           |
| DOWNLOAD: | muennighoff-2022-mteb.pdf     |          |        |            |     |        |           |
| SUCCESS:  | muennighoff-2022-mteb.pdf     |          |        |            |     |        |           |
| DOWNLOAD: | le-2014-doc2vec.pdf           |          |        |            |     |        |           |
| SUCCESS:  | le-2014-doc2vec.pdf           |          |        |            |     |        |           |
| DOWNLOAD: | gao-2021-simcse.pdf           |          |        |            |     |        |           |
| SUCCESS:  | gao-2021-simcse.pdf           |          |        |            |     |        |           |
| DOWNLOAD: | wang-2022-text-embeddings.pdf |          |        |            |     |        |           |
| SUCCESS:  | wang-2022-text-embeddings.pdf |          |        |            |     |        |           |
| DOWNLOAD: | lee-2023-token-retrieval.pdf  |          |        |            |     |        |           |
| SUCCESS:  | lee-2023-token-retrieval.pdf  |          |        |            |     |        |           |
| DOWNLOAD: | cai-2017-graph-embedding.pdf  |          |        |            |     |        |           |
| SUCCESS:  | cai-2017-graph-embedding.pdf  |          |        |            |     |        |           |
| DOWNLOAD: | dong-2022-dual-encoder.pdf    |          |        |            |     |        |           |
| SUCCESS:  | dong-2022-dual-encoder.pdf    |          |        |            |     |        |           |
| DOWNLOAD: | malkov-2016-hnsw.pdf          |          |        |            |     |        |           |
| SUCCESS:  | malkov-2016-hnsw.pdf          |          |        |            |     |        |           |
| DOWNLOAD: | guo-2020-anisotropic.pdf      |          |        |            |     |        |           |
| SUCCESS:  | guo-2020-anisotropic.pdf      |          |        |            |     |        |           |
| DOWNLOAD: | douze-2024-faiss.pdf          |          |        |            |     |        |           |
| SUCCESS:  | douze-2024-faiss.pdf          |          |        |            |     |        |           |
| DOWNLOAD: | lee-2024-gecko.pdf            |          |        |            |     |        |           |
| SUCCESS:  | lee-2024-gecko.pdf            |          |        |            |     |        |           |
| DOWNLOAD: | touvron-2023-llama.pdf        |          |        |            |     |        |           |
| SUCCESS:  | touvron-2023-llama.pdf        |          |        |            |     |        |           |
| DOWNLOAD: | nair-2025-matryoshka.pdf      |          |        |            |     |        |           |
| SUCCESS:  | nair-2025-matryoshka.pdf      |          |        |            |     |        |           |
| DOWNLOAD: | faysse-2024-colpali.pdf       |          |        |            |     |        |           |
| SUCCESS:  | faysse-2024-colpali.pdf       |          |        |            |     |        |           |
| DOWNLOAD: | gemini-team-2023.pdf          |          |        |            |     |        |           |
| SUCCESS:  | gemini-team-2023.pdf          |          |        |            |     |        |           |
| Embedding | papers                        | download | script | completed. |     |        |           |

